; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	infrared0 - mode
	image1 - mode
	GroundStation0 - direction
	Star4 - direction
	Star8 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star2 - direction
	GroundStation1 - direction
	GroundStation6 - direction
	Star3 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 image1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
	(supports instrument4 image1)
	(calibration_target instrument4 Star3)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star13)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite1 Phenomenon16)
	(have_image Phenomenon9 infrared0)
	(have_image Phenomenon10 image1)
	(have_image Planet11 infrared0)
	(have_image Phenomenon12 infrared0)
	(have_image Star13 image1)
	(have_image Star14 image1)
	(have_image Phenomenon15 image1)
	(have_image Phenomenon16 infrared0)
	(have_image Phenomenon17 infrared0)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 11
2. (calibrate satellite1 instrument2 groundstation7)
   added: (calibrated instrument2)
   goals met: 0 of 11
3. (turn_to satellite1 phenomenon15 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 11
4. (take_image satellite1 phenomenon15 instrument2 image1)
   added: (have_image phenomenon15 image1)
   goals met: 1 of 11
5. (turn_to satellite1 phenomenon12 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 11
6. (take_image satellite1 phenomenon12 instrument2 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 2 of 11
7. (turn_to satellite1 phenomenon10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 11
8. (turn_to satellite0 star8 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star8)
   goals met: 3 of 11
9. (take_image satellite1 phenomenon10 instrument2 image1)
   added: (have_image phenomenon10 image1)
   goals met: 4 of 11
10. (turn_to satellite1 phenomenon17 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon17)
   goals met: 4 of 11
11. (take_image satellite1 phenomenon17 instrument2 infrared0)
   added: (have_image phenomenon17 infrared0)
   goals met: 5 of 11
12. (turn_to satellite1 phenomenon9 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon9)
   goals met: 5 of 11
13. (take_image satellite1 phenomenon9 instrument2 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 6 of 11
14. (turn_to satellite1 planet11 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet11)
   goals met: 6 of 11
15. (take_image satellite1 planet11 instrument2 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 7 of 11
16. (turn_to satellite1 star13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star13)
   goals met: 7 of 11
17. (take_image satellite1 star13 instrument2 image1)
   added: (have_image star13 image1)
   goals met: 8 of 11
18. (turn_to satellite1 star14 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star14)
   goals met: 8 of 11
19. (take_image satellite1 star14 instrument2 image1)
   added: (have_image star14 image1)
   goals met: 9 of 11
20. (turn_to satellite1 phenomenon16 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 phenomenon16)
   goals met: 10 of 11
21. (take_image satellite1 phenomenon16 instrument2 infrared0)
   added: (have_image phenomenon16 infrared0)
   goals met: 11 of 11
